
# В разработке: жду доступа к bitrix от заказчика. Временно для создания архитектуры ввел шаблоны данных.


category_products = '<b>▪️ Товар 1</b> (/id001)\n\n' \
             '<b>▪️ Товар 2</b> (/id002)\n\n' \
             '<b>▪️ Товар 3</b> (/id003)\n\n' \
             '<b>▪️ Товар 4</b> (/id004)\n\n'\
             '<b>▪️ Товар 5</b> (/id005)'

product_description = '<b>*Заголовок товараЗаголовок товара*</b>\n\n' \
                  '*Описание товараОписание товараОписание товараОписание товараОписание товараОписание товараОписание товара*\n\n' \
                  'Цена: *Цена товара*\n'